{
  "color": {
    "background": {
      "brand": {
        "description": "Core brand surface — used for high-visibility elements such as CTAs, banners, or branded sections.",
        "value": "{color.emerald-green.600}"
      },
      "brand-dark": {
        "description": "Darker brand tone for hover or elevated surfaces — reinforces brand color with stronger contrast.",
        "value": "{color.forest-green.900}"
      },
      "brand-subtle": {
        "description": "Gentle brand tint used as a soft highlight or background accent — maintains brand presence without dominating content.",
        "value": "{color.emerald-green.50}"
      },
      "dark-default": {
        "description": "The foundational surface for dark-toned sections — provides contrast for light text and imagery.",
        "value": "{color.neutral.950}"
      },
      "dark-gray-01": {
        "description": "A raised surface within dark sections — used for containers, cards, or UI areas sitting above the dark base.",
        "value": "{color.neutral.900}"
      },
      "dark-gray-02": {
        "description": "A higher elevation surface for dark environments — applied to interactive or nested elements like hovers or secondary layers.",
        "value": "{color.neutral.800}"
      },
      "description": "Background tokens define the core surface layers across the system. They establish depth, contrast, and tone — from foundational page backgrounds to elevated components and brand-driven sections.",
      "light-default": {
        "description": "The foundational surface for light sections — used for page backgrounds and primary content areas.",
        "value": "{color.neutral.950}"
      },
      "light-gray-01": {
        "description": "A raised surface on light backgrounds — ideal for cards, containers, and UI elements sitting above the base layer.",
        "value": "{color.neutral.900}"
      },
      "light-gray-02": {
        "description": "A higher elevation surface for light environments — applied to interactive or nested elements like hovers or secondary layers.",
        "value": "{color.neutral.800}"
      },
      "overview": [
        "Light and dark backgrounds represent tonal environments, not themes, providing flexibility for both product and marketing layouts.",
        "Brand backgrounds introduce expressive color into surfaces such as CTAs, banners, or branded panels, while accent backgrounds draw attention to high-priority or urgent content.",
        "Use higher elevation tokens (-01, -02, or -dark) for raised, interactive, or nested surfaces, ensuring clear visual hierarchy without overpowering content."
      ],
      "state-attention": {
        "description": "High-impact background color used for attention states like live content, breaking news, or errors — conveys urgency and energy across contexts.",
        "value": "{color.red.400}"
      }
    },
    "border": {
      "brand-01": {
        "description": "Primary brand border used to introduce subtle brand presence — applies the main brand color in decorative or accent details.",
        "value": "{color.emerald-green.600}"
      },
      "brand-02": {
        "description": "Secondary brand border used to introduce subtle brand presence — applies the secondary brand color in decorative or accent details.",
        "value": "{color.spring-green.400}"
      },
      "description": "Border tokens provide structure, separation, and emphasis across all tonal environments. They adapt to the surface tone (on-light or on-dark) to ensure consistent visibility and contrast.",
      "on-dark-strong-01": {
        "description": "Used on dark backgrounds to define boundaries between distinct components or layout sections — offers clear separation.",
        "value": "{color.neutral.400}"
      },
      "on-dark-strong-02": {
        "description": "Used on dark backgrounds for strong contrast or container outlines — ideal for high-visibility boundaries or interactive components.",
        "value": "{color.base.white}"
      },
      "on-dark-subtle-01": {
        "description": "Used on dark backgrounds to separate related content or elements within the same group — provides gentle contrast without disrupting the tone.",
        "value": "{color.neutral.800}"
      },
      "on-dark-subtle-02": {
        "description": "Used on dark backgrounds to separate related content or elements within the same group — provides gentle contrast without disrupting the tone.",
        "value": "{color.neutral.700}"
      },
      "on-light-strong-01": {
        "description": "Used on light backgrounds to define boundaries between distinct components or layout sections — provides clear structural separation.",
        "value": "{color.neutral.400}"
      },
      "on-light-strong-02": {
        "description": "Used on light backgrounds for strong emphasis or container outlines — ideal for high-contrast boundaries or interactive components.",
        "value": "{color.base.white}"
      },
      "on-light-subtle-01": {
        "description": "Used on light backgrounds to separate related content or elements within the same group — provides gentle visual distinction.",
        "value": "{color.neutral.900}"
      },
      "on-light-subtle-02": {
        "description": "Used on light backgrounds for slightly stronger separation between related elements — maintains subtle contrast without drawing attention.",
        "value": "{color.neutral.700}"
      },
      "overview": [
        "Subtle borders are used to separate related content or elements within a shared surface.",
        "Strong borders define clear boundaries between distinct sections or components.",
        "State borders such as disabled, focus, and red communicate interaction or status changes.",
        "Brand borders reflect the brand's visual identity — 01 represents the primary brand color, and 02 represents the secondary brand color — adding personality without overwhelming content."
      ],
      "state-attention-on-dark": {
        "description": "Attention border used on dark backgrounds to indicate urgency or alert states such as errors, live content, or breaking news.",
        "value": "{color.red.400}"
      },
      "state-attention-on-light": {
        "description": "Attention border used on light backgrounds to indicate urgency or alert states such as errors, live content, or breaking news.",
        "value": "{color.red.400}"
      },
      "state-disabled-on-dark": {
        "description": "Used on dark backgrounds for disabled components — provides a low-contrast outline to indicate inactive state.",
        "value": "{color.neutral.800}"
      },
      "state-disabled-on-light": {
        "description": "Used on light backgrounds for disabled components — provides a muted outline that communicates inactive state.",
        "value": "{color.neutral.800}"
      },
      "state-focus": {
        "description": "Functional border used to indicate interactive focus states for components — provides clear visual feedback for accessibility and navigation.",
        "value": "{color.base.white}"
      }
    },
    "brand": {
      "01": {
        "description": "Primary brand color representing the core Strib identity.",
        "value": "{color.emerald-green.600}"
      },
      "02": {
        "description": "Supporting brand color used for balance and variation in brand materials.",
        "value": "{color.spring-green.500}"
      },
      "03": {
        "description": "Deep secondary brand color used for depth and contrast in marketing visuals.",
        "value": "{color.forest-green.900}"
      },
      "04": {
        "description": "Accent brand color adding vibrancy and energy to brand compositions.",
        "value": "{color.lime.400}"
      },
      "description": "Brand colors establish the core visual identity to express the brand across digital and print materials. Brand colors are intended for expressive, marketing, and creative applications, but are not tied to specific UI functions or component usage."
    },
    "button": {
      "brand": {
        "filled": {
          "background": { "value": "{color.spring-green.400}" },
          "hover-background": { "value": "{color.spring-green.300}" },
          "hover-text": { "value": "{color.base.black}" },
          "text": { "value": "{color.base.black}" }
        },
        "ghost": {
          "background": { "value": "rgb(0 0 0 0)" },
          "hover-background": {
            "_comment": "16% opacity of spring-green.400 for subtle hover effect",
            "value": "rgb(118 216 110 / 16%)"
          },
          "hover-text": { "value": "{color.spring-green.400}" },
          "text": { "value": "{color.spring-green.400}" }
        },
        "outlined": {
          "background": { "value": "rgb(0 0 0 0)" },
          "border": { "value": "{color.spring-green.400}" },
          "hover-background": {
            "_comment": "16% opacity of spring-green.400 for subtle hover effect",
            "value": "rgb(118 216 110 / 16%)"
          },
          "hover-text": { "value": "{color.spring-green.400}" },
          "text": { "value": "{color.spring-green.400}" }
        }
      },
      "brand-accent": {
        "filled": {
          "background": { "value": "{color.lime.400}" },
          "hover-background": { "value": "{color.lime.200}" },
          "hover-text": { "value": "{color.forest-green.900}" },
          "text": { "value": "{color.forest-green.900}" }
        },
        "ghost": {
          "background": { "value": "rgb(0 0 0 0)" },
          "hover-background": {
            "_comment": "16% opacity of lime.400 for subtle hover effect",
            "value": "rgb(200, 250, 49 / 16%)"
          },
          "hover-text": { "value": "{color.emerald-green.800}" },
          "text": { "value": "{color.lime.300}" }
        },
        "outlined": {
          "background": { "value": "rgb(0 0 0 0)" },
          "border": { "value": "{color.lime.400}" },
          "hover-background": {
            "_comment": "16% opacity of lime.400 for subtle hover effect",
            "value": "rgb(200, 250, 49 / 16%)"
          },
          "hover-text": { "value": "{color.lime.400}" },
          "text": { "value": "{color.lime.300}" }
        }
      },
      "description": "Button color tokens define the color palette for interactive UI components like buttons. Brand controls use expressive brand colors, while shared control styles (filled, outlined, ghost, utility) are available in the base color tokens.",
      "overview": [
        "Brand controls use the primary brand colors to create expressive, branded interactive elements for buttons, checkboxes, radio buttons, switches, and similar components.",
        "Brand-accent controls provide a secondary branded option with higher contrast or alternative styling, including border styles where applicable.",
        "Shared control styles (filled, outlined, ghost, utility) are defined in base colors and work across all brands and component types."
      ]
    },
    "icon": {
      "brand-01": {
        "description": "Brand icon color using the primary brand hue — applied for expressive or active states to reinforce brand identity within the interface.",
        "value": "{color.emerald-green.600}"
      },
      "brand-02": {
        "description": "Brand icon color using the secondary brand hue — applied for expressive or active states to reinforce brand identity within the interface.",
        "value": "{color.emerald-green.900}"
      },
      "brand-03": {
        "description": "Brand icon color using the tertiary brand hue — applied for expressive or active states to reinforce brand identity within the interface.",
        "value": "{color.lime.400}"
      },
      "description": "Icon tokens ensure clarity, hierarchy, and brand consistency across all tonal environments. They adapt to the surface tone (on-light or on-dark) to maintain visibility and balance with surrounding text and components.",
      "on-dark-primary": {
        "description": "Primary icon color for use on dark backgrounds — provides maximum visibility for key actions and navigation icons.",
        "value": "{color.base.white}"
      },
      "on-dark-secondary": {
        "description": "Secondary icon color for use on dark backgrounds — used for supportive or secondary actions that maintain clear visual hierarchy.",
        "value": "{color.neutral.50}"
      },
      "on-dark-tertiary": {
        "description": "Tertiary icon color for use on dark backgrounds — used for low-emphasis icons or background details within dark environments.",
        "value": "{color.neutral.200}"
      },
      "on-light-primary": {
        "description": "Primary icon color for use on light backgrounds — used for key actions, navigation icons, or high-emphasis visuals.",
        "value": "{color.base.white}"
      },
      "on-light-secondary": {
        "description": "Secondary icon color for use on light backgrounds — used for supportive icons or secondary actions that complement primary content.",
        "value": "{color.neutral.200}"
      },
      "on-light-tertiary": {
        "description": "Tertiary icon color for use on light backgrounds — used for low-emphasis icons, decorative elements, or background indicators.",
        "value": "{color.neutral.400}"
      },
      "overview": [
        "Primary, secondary, and tertiary tokens define emphasis levels, supporting clear visual hierarchy in iconography.",
        "State tokens such as attention and disabled align with system-wide semantics to communicate status and interaction.",
        "Brand icon tokens apply brand colors expressively or for active states — 01, 02, and 03 represent the primary, secondary, and tertiary brand hues, allowing designers to select the tone that best fits the visual context."
      ],
      "state-attention-on-dark": {
        "description": "Attention icon color for use on dark backgrounds — draws focus to breaking, live, or high-urgency actions.",
        "value": "{color.red.400}"
      },
      "state-attention-on-light": {
        "description": "Attention icon color for use on light backgrounds — draws focus to breaking, live, or high-urgency actions.",
        "value": "{color.red.400}"
      },
      "state-disabled-on-dark": {
        "description": "Disabled icon color for use on dark backgrounds — indicates inactive states through low contrast and reduced emphasis.",
        "value": "{color.neutral.600}"
      },
      "state-disabled-on-light": {
        "description": "Disabled icon color for use on light backgrounds — indicates inactive states through low contrast and reduced emphasis.",
        "value": "{color.neutral.600}"
      }
    },
    "overlay": {
      "black": {
        "description": "Primary dark overlay used behind modals, drawers, or high-emphasis layers — creates strong contrast and draws attention to the active surface.",
        "value": "rgb(0 0 0 / 60%)"
      },
      "black-subtle": {
        "description": "Lighter dark overlay used for less intrusive layering — ideal for tooltips, media overlays, or subtle depth effects.",
        "value": "rgb(0 0 0 / 30%)"
      },
      "description": "Overlays provide tonal flexibility and visual depth across the interface. They are used both functionally—to dim content behind modals, drawers, or other elevated layers—and visually, to enhance contrast or readability over imagery, video, or brand surfaces.",
      "overview": [
        "Use darker overlays on light backgrounds to reduce distraction and direct attention to the active layer.",
        "Use lighter overlays on dark or saturated backgrounds to ensure legibility and maintain clarity.",
        "Choose “subtle” variants for lightweight layering or when background content should remain partially visible."
      ],
      "white": {
        "description": "Primary light overlay used on dark or vivid backgrounds — improves legibility and contrast for UI elements like buttons, icons, or text over imagery.",
        "value": "rgb(255 255 255 / 60%)"
      },
      "white-subtle": {
        "description": "Soft light overlay for gentle contrast or lower emphasis — often used for hover states, secondary overlays, or subtle layering on dark media.",
        "value": "rgb(255 255 255 / 30%)"
      }
    },
    "semantic": {
      "description": "Semantic tokens communicate meaning and feedback across the interface. They represent universal states — such as information, success, warning, and error — and are used across multiple components including alerts, banners, toasts, and badges. Each semantic pair (background and foreground) is designed for clear contrast and accessibility, ensuring legibility across different tonal environments.",
      "error-background": {
        "description": "Background color for critical or error messages — used to indicate failure, blocking issues, or urgent errors requiring attention.",
        "value": "{color.red.900}"
      },
      "error-foreground": {
        "description": "Foreground color for error messages — used for text or icons on error backgrounds to maintain legibility and emphasis.",
        "value": "{color.red.200}"
      },
      "info-background": {
        "description": "Background color for informational messages and neutral alerts — used to indicate general updates or contextual information.",
        "value": "{color.sky-blue.800}"
      },
      "info-foreground": {
        "description": "Foreground color for informational messages — used for text or icons that appear on info backgrounds to maintain clarity and contrast.",
        "value": "{color.sky-blue.300}"
      },
      "success-background": {
        "description": "Background color for positive or successful outcomes — used to indicate completion, confirmation, or resolved states.",
        "value": "{color.spring-green.900}"
      },
      "success-foreground": {
        "description": "Foreground color for success messages — used for text or icons displayed on success backgrounds to ensure strong contrast and visibility.",
        "value": "{color.spring-green.200}"
      },
      "warning-background": {
        "description": "Background color for cautionary or warning messages — used to signal potential issues, risks, or required user awareness.",
        "value": "{color.orange.900}"
      },
      "warning-foreground": {
        "description": "Foreground color for warning messages — used for text or icons on warning backgrounds to ensure readable contrast.",
        "value": "{color.orange.200}"
      }
    },
    "text": {
      "brand-01": {
        "description": "Primary brand text color used in marketing and promotional content — applies the main brand color for emphasis or expressive typography.",
        "value": "{color.emerald-green.600}"
      },
      "brand-02": {
        "description": "Secondary brand text color used in marketing and promotional content — applies the secondary brand color for variety or contrast.",
        "value": "{color.forest-green.900}"
      },
      "brand-03": {
        "description": "Tertiary brand text color used in marketing and promotional content — applies the tertiary brand color to support balance and brand richness.",
        "value": "{color.lime.400}"
      },
      "description": "Text tokens define the hierarchy and tone of all written content across the system. They adapt to tonal environments (on-light or on-dark) to ensure readability and consistent contrast.",
      "on-dark-primary": {
        "description": "Primary text color for use on dark backgrounds — provides maximum legibility for body copy, headlines, and titles.",
        "value": "{color.base.white}"
      },
      "on-dark-secondary": {
        "description": "Secondary text color for use on dark backgrounds — used for supporting content, subheadings, or secondary information.",
        "value": "{color.neutral.50}"
      },
      "on-dark-tertiary": {
        "description": "Tertiary text color for use on dark backgrounds — used for low-emphasis content such as labels, metadata, or helper text.",
        "value": "{color.neutral.200}"
      },
      "on-light-primary": {
        "description": "Primary text color for use on light backgrounds — used for high-emphasis content such as body copy, headlines, and titles.",
        "value": "{color.base.white}"
      },
      "on-light-secondary": {
        "description": "Secondary text color for use on light backgrounds — used for supporting content, subheadings, or secondary information.",
        "value": "{color.neutral.200}"
      },
      "on-light-tertiary": {
        "description": "Tertiary text color for use on light backgrounds — used for low-emphasis content such as labels, metadata, or helper text.",
        "value": "{color.neutral.400}"
      },
      "overview": [
        "Primary, secondary, and tertiary tokens establish clear emphasis levels, guiding typographic hierarchy across layouts.",
        "State tokens such as attention and disabled communicate interaction or status changes, aligning with system-wide semantics.",
        "Brand text tokens apply brand colors expressively in marketing, CTA, or campaign contexts — 01, 02, and 03 represent primary, secondary, and tertiary brand colors, providing flexibility for visual balance."
      ],
      "state-attention-on-dark": {
        "description": "Attention text color used on dark backgrounds to highlight breaking, live, or alert content",
        "value": "{color.red.400}"
      },
      "state-attention-on-light": {
        "description": "Attention text color used on light backgrounds to highlight breaking, live, or alert content",
        "value": "{color.red.400}"
      },
      "state-disabled-on-dark": {
        "description": "Disabled text color for use on dark backgrounds — provides low-contrast indication of inactive or unavailable content.",
        "value": "{color.neutral.600}"
      },
      "state-disabled-on-light": {
        "description": "Disabled text color for use on light backgrounds — communicates inactive or non-interactive states for components and inputs.",
        "value": "{color.neutral.600}"
      }
    }
  }
}
